docs/architecture/proposals/PAY-329-load-testing/artillery/1000-rpm.yml
config:
  target: "https://example-api/payments"
  phases:
    - duration: 300
      arrivalRate: 17
      name: baseline-1000-rpm
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

scenarios:
  - name: create-payment-1000-rpm
    flow:
      - post:
          url: "/payments"
          json:
            clientId: "load-test-client"
            caseNumber: "2026-0001"
            amount: 125.00
            currency: "USD"
            paymentType: "filing-fee"
            payer:
              firstName: "Test"
              lastName: "User"
              email: "loadtest@example.com"
            metadata:
              source: "artillery-spike"
              environment: "load-test"
              requestId: "1000-rpm-sample"